# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# # Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.
from itertools import count
from itertools import cycle

def count_func(start, finish):
    for i in count(start):
        if i > finish:
            break
        else:
            print(i)
count_func(start = int(input("Первое число: ")), finish = int(input("Последнее число: ")))

def cycle_func(list, iteration):
    с = 0
    for i in cycle(list):
        if с > iteration:
            break
        print(i)
        с += 1

cycle_func(list = [1, 2, 3, 4, 5], iteration = int(input("Количество итераций: ")))

